


&НаКлиенте
Процедура Искать(Команда)  
	
	Если Объект.РазмерностьМассива = 0 Тогда 
		
		Сообщить("Необходимо задать Размер массива");
		
	Иначе
		
		РазмерностьМассива = Объект.РазмерностьМассива;
		МассивДляПоиска = СформироватьМассив(РазмерностьМассива);
		
		Сообщить("Массив сформирован");
		
		
		Если Объект.ИскомоеЧисло = 0 ИЛИ Объект.ИскомоеЧисло > РазмерностьМассива  Тогда
			
			Сообщить("Некорректно задно искомое число !");
			
		Иначе 
			
			// Границы 		
			НижняяГраницаПоиска = 0; 
			ВерхняяГраницаПоиска = РазмерностьМассива-1; 
			
			КоличествоИтераций = 0 ;
			
			Пока НижняяГраницаПоиска <= ВерхняяГраницаПоиска Цикл 
				
				// Округляем вниз
				МедианаМассива = Цел((НижняяГраницаПоиска + ВерхняяГраницаПоиска)/2);
				Гипотеза = МассивДляПоиска[МедианаМассива];			
				// Нашли	
				Если Объект.ИскомоеЧисло = Гипотеза  Тогда				
					Прервать;				
				// Режем сверху
				ИначеЕсли Объект.ИскомоеЧисло < Гипотеза Тогда    				
					ВерхняяГраницаПоиска = МедианаМассива -1;
				// Режем снизу
				Иначе	
					НижняяГраницаПоиска = МедианаМассива + 1;				
				КонецЕсли;
				КоличествоИтераций = КоличествоИтераций + 1;
			КонецЦикла;
			
			Объект.КоличествоИтераций = КоличествоИтераций;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Индекс Элемента : %1, Значение Элемента : %2, итераций : %3"
					, МедианаМассива, Гипотеза, КоличествоИтераций);
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Функция СформироватьМассив(РазмерностьМассива)
	
	МассивЧисел = Новый Массив;
	
	Итератор = 1;
	
	Пока Итератор < РазмерностьМассива + 1  Цикл 
		МассивЧисел.Вставить(Итератор - 1,Итератор);
		Итератор = Итератор + 1;
	КонецЦикла;   
	
	Возврат МассивЧисел;
		
КонецФункции


